<template>
  <HeaderComponent />
  <router-view />
</template>

<script>
import HeaderComponent from './components/HeaderComponent.vue';
export default {
  components: {
    HeaderComponent
  }
}
// 1
// Вы разрабатываете SPA приложение с использованием фреймворка Vue.js, которое имеет несколько разделов или страниц. Вам нужно реализовать навигацию между разделами приложения с помощью маршрутизации.
// Требования:
// Создайте компоненты для каждого раздела приложения. Например, у вас может быть компонент "Домашняя страница", "О нас", "Контакты" и т. д.
// Создайте маршруты для каждого раздела приложения с использованием Vue Router.
// Реализуйте навигационное меню или компонент, который отображает ссылки на каждый раздел приложения.
// При клике на ссылку в навигационном меню пользователь должен переходить на соответствующий раздел приложения без перезагрузки страницы.

//2
// Расширьте предыдущую задачу на навигацию внутри SPA приложения с использованием Vue Router, чтобы обрабатывать случай, когда пользователь пытается перейти по несуществующему маршруту. В этом случае вы должны отображать страницу с ошибкой 404.

// Создайте новый компонент, например, NotFound.vue, который будет представлять страницу с ошибкой 404.
// Обновите файл router.js для добавления маршрута для обработки ошибки 404. Этот маршрут должен соответствовать любому несуществующему маршруту в приложении.
// //3
// Вы разрабатываете интернет-магазин и хотите реализовать функциональность переключения пагинации на странице каталога товаров с помощью Vue Router.
// Создайте компонент Catalog.vue, который будет отображать список товаров и пагинацию.
// Реализуйте пагинацию, где каждая страница будет содержать определенное количество товаров (например, 10 товаров на страницу).
// Используйте Vue Router для настройки маршрута страницы каталога, который будет принимать номер страницы в качестве динамического сегмента URL.
// При переключении страницы пагинации с помощью клика на номер страницы, должен изменяться параметр в URL и компонент Catalog.vue должен обновляться с соответствующим списком товаров для выбранной страницы.
// https://v3.router.vuejs.org/ru/guide/advanced/meta.html
// https://tproger.ru/articles/routing-in-vue/
// <router-link :to="{ name: 'user', params: { userId: 123 }}">Пользователь</router-link>
// https://v3.router.vuejs.org/ru/api/#router-resolve

</script>